{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "layers": [{"name": "encoder_inputs", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null], "name": "encoder_inputs"}, "class_name": "InputLayer"}, {"name": "encoder_embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "config": {"embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 30], "name": "encoder_embedding", "embeddings_regularizer": null, "output_dim": 256, "activity_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "input_length": 30, "trainable": true, "input_dim": 602}, "class_name": "Embedding"}, {"name": "decoder_inputs", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 601], "name": "decoder_inputs"}, "class_name": "InputLayer"}, {"name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 256, "unroll": false, "unit_forget_bias": true, "use_bias": true, "name": "encoder_lstm", "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": true, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 256, "unroll": false, "unit_forget_bias": true, "use_bias": true, "name": "decoder_lstm", "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": true, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"name": "decoder_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "decoder_dense", "use_bias": true, "units": 601, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "output_layers": [["decoder_dense", 0, 0]], "name": "model_1"}, "class_name": "Model"}